#include <iostream>
#include <map>
#include <string>

using namespace std;

int main() {
    // Создаем словарь для азбуки Морзе
    map<char, string> morseCode = {
        {'А', ".-"}, {'Б', "-..."}, {'В', ".--"}, {'Г', "--."}, {'Д', "-.."},
        {'Е', "."}, {'Ж', "...-"}, {'З', "--.."}, {'И', ".."}, {'Й', ".---"},
        {'К', "-.-"}, {'Л', ".-.."}, {'М', "--"}, {'Н', "-."}, {'О', "---"},
        {'П', ".--."}, {'Р', ".-."}, {'С', "..."}, {'Т', "-"}, {'У', "..-"},
        {'Ф', "..-."}, {'Х', "...."}, {'Ц', "-.-."}, {'Ч', "---."}, {'Ш', "----"},
        {'Щ', "--.-"}, {'Ы', "-.--"}, {'Ь', "-..-"}, {'Ъ', "--.--"}, {'Э', "..-.."},
        {'Ю', "..--"}, {'Я', ".-.-"}
    };

    string message;
    cout << "Введите сообщение на русском языке: ";
    getline(cin, message);

    cout << "Сообщение в азбуке Морзе: ";
    for (char c : message) {
        if (morseCode.find(toupper(c)) != morseCode.end()) {
            cout << morseCode[toupper(c)] << " ";
        } else {
            cout << " "; // Если символ не найден, выводим пробел
        }
    }

    return 0;
}
